In [20]:
import pandas as pd

In [21]:
df_gpt = pd.read_csv('transformed_data_men_21_to_24_chatgpt.csv')
df_gpt = df_gpt[['team','sent_score1','sent_score2','sent_score3']].drop_duplicates()
df_gpt.head()

                  team  sent_score1  sent_score2  sent_score3
0    Abilene Christian           47           45           54
100          Air Force           72           65           47
209              Akron           74           74           78
314            Alabama           85           85           85
440        Alabama A&M           64           67           64

In [22]:
df_gpt['gpt_sent_score_avg'] = (df_gpt['sent_score1'] + df_gpt['sent_score2'] + df_gpt['sent_score3']) / 3

In [23]:
df_gpt[['team','gpt_sent_score_avg']].head()

                  team  gpt_sent_score_avg
0    Abilene Christian           48.666667
100          Air Force           61.333333
209              Akron           75.333333
314            Alabama           85.000000
440        Alabama A&M           65.000000

In [24]:
df_gpt[['team','gpt_sent_score_avg']].to_csv('team_gpt_score.csv',index=False)